import React, { useState } from "react";
import "./FAQ.css";
import { FaAngleDown } from "react-icons/fa";

const questions = [
  {
    question: "כמה זמן לוקח לראות תוצאות ?",
    answer:
      "הרצון הטבעי שלנו הוא לראות מיד תוצאות, כאן ועכשיו! אני פה כדי להגיד את האמת ורק את האמת. תוצאות יתקבלו אם תלכו לפי הכללים, אם תשקיעו ותהיו עמוק בתהליך, מהר זה יקרה. אין קסם ואין קיצורי דרך. התוצאות הן שונות מאדם לאדם ולכל אחד גוף שבנוי אחרת עם יכולות אחרות וכן גם גנים שונים ולכן יכול להיות שהחברה שהתחילה איתכן בתהליך תרד מהר יותר במשקל ותראה תוצאות מהר יותר ולך יקח קצת יותר זמן, אל תתייאשו!",
  },
  {
    question: "אם ארים משקולות אהיה שרירית מידי ?",
    answer:
      "זאת מחשבה נפוצה מאוד בקרב נשים והתשובה לכך היא ברורה מאוד - אם לא תרצי בכך זה לא יקרה! הגעה למראה השרירי והנפוח לא קלה בכלל ודורשת מאמץ רב והשקעה רבה. יש להקפיד על תזונה מותאמת ואימונים מאוד ספציפים, בשורה תחתונה אם לא תרצי להיראות כמו רמבו אז הסיכוי לכך שזה יקרה הוא אפסי! הרמת משקולות מטרתה היא לעצב את הגוף ולכן אל תפחדו מזה ולהיפך חבקו את זה באהבה.",
  },
  {
    question: "האם אפשר לשרוף שומן מאזור מסוים בגוף ?",
    answer:
      "הלוואי, לא זו אינה תוכנית כבקשתך ואין אפשרות לשרוף שומן ממקום מסוים. שומנים מצטברים בכל מקום בגוף ועל מנת לשרוף אחוזי שומן יש לבצע שינוי על ידי תזונה בריאה דלת שומן ופחמימות.",
  },
  {
    question: "האם מספיק רק להתאמן כדי לרדת במשקל ?",
    answer:
      "אימון זאת התחלה נהדרת כדי להגיע ליעד אבל בהחלט לא מספיק! הנטייה היא לחשוב אם התאמנתי אני יכולה לאכול מה שאני רוצה, אז זהו שלא. אם תעשי כך סביר להניח שלא תראי תוצאות כלל. תזונה נכונה וספורט הן ללא ספק מילים שהולכות יחד יד ביד וקשורות אחת בשניה בקשר הדוק. התזונה צריכה להיות תואמת לכל אחד ואחת באופן אישי ולפי ההעדפות האישיות שלו.",
  },
  {
    question: "מדוע חשוב לשמור על תזונה בריאה, במקביל לשמירה על כושר ?",
    answer:
      "יש ללוות את הפעילות הגופנית בשמירה על תזונה בריאה דלת שומן ופחמימות מכיוון שאיש לא יבחין במבנה השרירים שנוצרו בעקבות אימונים מפרכים אם סביבם תהיה רקמת שומן שתסתיר אותם.",
  },
  {
    question:
      "מתי מתחילים לשרוף קלוריות בפעילות גופנית מסוג אירובי ואנאירובי ?",
    answer:
      "הגוף שורף קלוריות בכל רגע נתון, כמות הקלוריות שנשרפת תלויה בעוצמת הפעילות: ככל שהפעילות אינטנסיבית יותר, כך הגוף ישרוף יותר קלוריות.",
  },
];

const FAQ = () => {
  const [activeQuestion, setActiveQuestion] = useState(null);

  const toggle = (i) => {
    setActiveQuestion(i === activeQuestion ? null : i);
  };

  return (
    <>
      <div className='faq-box' id='faq-box'>
        <div className='faq'>
          <h1>יש לך שאלות ?</h1>
          {questions.map((item, i) => (
            <div className='faq-item' key={i}>
              <div className='title' onClick={() => toggle(i)}>
                <h1 style={activeQuestions[i] ? { color: "pink" } : {}}>
                  {item.question}
                </h1>
                <FaAngleDown
                  className={
                    activeQuestion === i ? "faq-icon flip" : "faq-icon"
                  }
                />
              </div>
              <div className={activeQuestion === i ? "answer show" : "answer"}>
                <p>{item.answer}</p>
              </div>
            </div>
          ))}
        </div>
      </div>
    </>
  );
};

export default FAQ;
