import React from "react";
import "./Studio.css";

function Studio() {
  return (
    <>
      <div className='studio' id='studio'>
        <div className='studio__container'>
          <div className='studio__text-container'>
            <h1>הסטודיו</h1>
            <p>
              פילאטיס היא צורת פעילות גופנית שפותחה בתחילת המאה ה-20 על ידי
              ג'וזף פילאטיס. המטרה של צורת פעילות גופנית זו היא להתמקד בליבת
              הגוף, הכוללת את השרירים העמוקים המייצבים ותומכים בעמוד השדרה. קרן
              פילאטיס
            </p>
            <p>
              ויוגה הינו סטודיו בוטיק פופולרי בעיר עפולה שאליו נשים יכולות ללכת
              ללמוד עוד על צורת פעילות גופנית זו בקבוצות קטנות. בסטודיו מערך
              מגוון של שיעורים לכל הרמות, מה שמקל על המתאמנות לתזמן את זמנם לפי
              לוח הזמנים של קרן פילאטיס. השיעורים בסטודיו שלנו מתאימים לנשים
              שרוצות
            </p>
          </div>
          <img src='/src/assets/gymexample.jpg' alt='' />
        </div>
      </div>
    </>
  );
}

export default Studio;
